#include <iostream>
#include <cmath>
using namespace std;

/*Даден е двумерен масив 6х5 от естествени числа от интервала [0..100], чийто стойности са въведени предварително.
Да се състави програма на C++, чрез която се извеждат елементите от масива с най-малката и най-голямата стойност.
Пример:
48,72,13,14,15
21,22,53,24,75
31,57,33,34,35
41,95,43,44,45
59,52,53,54,55
61,69,63,64,65
Изход: най-малко 13; най-голямо 95*/

int main()
{

    // 1. Създаваме двумерен масив с предварително зададени стойности.

    int matrix[6][5] = {
        {48, 72, 13, 14, 15},
        {21, 22, 53, 24, 75},
        {31, 57, 33, 34, 35},
        {41, 95, 43, 44, 45},
        {59, 52, 53, 54, 55},
        {61, 69, 63, 64, 65}};

    // 2. Създаваме едномерен масив и прехвърляме тук всички елементи от двумерния масив.

    int arr[30];
    int a = 0;
    for (int i = 0; i < 6; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            arr[a] = matrix[i][j];
            a++;
        }
    }

    // 3. Търсим елементите с най-малката и най-голямата стойност, вече прехвърлени в едномерния масив.

    int maxValue = 0;
    int minValue = 101;
    for (int i = 0; i < 30; i++)
    {
        if (arr[i] > maxValue)
        {
            maxValue = arr[i];
        }

        if (arr[i] < minValue)
        {
            minValue = arr[i];
        }

    }

    // 4. Извеждаме резултата.

    cout << "Min value: " << minValue << endl;
    cout << "Max value: " << maxValue << endl;

    return 0;
}