#include <iostream>
using namespace std;

/*Принтиране на обърнат триъгълник с десен прав ъгъл.*/
//        *
//       **
//      ***
//     ****
//    *****

int main()
{
    while (true)
    {
        int rows;
        char symbol;
        cout << "How many rows do you want the triangle to be?: ";
        cin >> rows;
        cout << "Which symbol do you want to use in the pattern?: ";
        cin >> symbol;
        system("cls");

        for (int i = 1; i <= rows; i++) // Правим толкова итерации, колкото следва да са редовете на триъгълника.
        {

            for (int align = rows; align >= i; align--) // Подравняваме тригълника отдясно.
            {
                cout << ' '; // Тъй като тук имаме декремантация, на 1ви ред ще се принтират 5 интервала, на 2ри - 4 и т.н. Така "избутваме" symbol, за да се получи обръщане на правия ъгъл вдясно.
            }

            for (int j = 1; j <= i; j++) // Заявяваме, че броят symbol в ред следва да отговаря на броя на реда.
            {
                cout << symbol; // Тъй като тук имаме инкрементация, на 1ви ред ще се принтира един symbol, на 2ри - два и т.н. Без подравняването, ще се получи триъгълник с прав ъгъл вляво.
            }

            // С двата вложени for цикъла, на всеки ред ще имаме по еднакъв брой символи - интервали и symbol (интервалите намаляват обратно пропорционално на символи).

            cout << endl; // ако не поставим нов ред след всяка итерация i, всички symbol ще се изпишат на един ред, а не под формата на триъгълник.
        }
    }
    return 0;
}