#include <iostream>
using namespace std;

/*Принтиране на форма Checkerboard*/
// * * * * *
//  * * * * *
// * * * * *
//  * * * * *
// * * * * *

int main()
{
    int rows;
    cout << "How many rows do you want the pattern to be?:" << endl;
    cin >> rows;

    for (int i = 1; i <= rows; i++) // Правим толкова итерации, колкото следва да са редовете на шаблона.
    {
        for (int j = 1; j <= i; j++) // Тъй като тук имаме инкрементация, на 1ви ред ще се принтират най-малко *, а на последен - най-много.
        {
            i % 2 != 0 ? cout << "* " : cout << " *"; // Според това дали редът е четен или нечетен, задаваме как да изглежда шаблона за съответния ред.
        }

        for (int k = rows; k >= i; k--) // Тъй като тук имаме декремантация, на 1ви ред ще се принтират най-много *, а на последен - най-малко.
        {
            i % 2 != 0 ? cout << "* " : cout << " *"; // Според това дали редът е четен или нечетен, задаваме как да изглежда шаблона
        }
        // Когато комбинираме двата вложени for цикъла, на всеки ред ще имаме по еднакъв брой *

        cout << endl; // Отделяме всеки създаден шаблон на отеделен ред.
    }

    return 0;
}