#include <iostream>
#include <iomanip> // setw(2) - задаваме отстояние
using namespace std;

/*Принтиране на форма Checkerboard*/
// * * * * *
//  * * * * *
// * * * * *
//  * * * * *
// * * * * *

int main()
{
    while (true)
    {
        int rows;
        char symbol;
        cout << "\nHow many rows do you want the pattern to be?:" << endl;
        cin >> rows;
        cout << "Which symbol do you want to use in the pattern?:" << endl;
        cin >> symbol;
        system("cls"); // Изчистваме конзолата след всеки изведен шаблон.

        for (int i = 1; i <= rows; i++) // Правим толкова итерации, колкото следва да са редовете на шаблона.
        {
            for (int j = 1; j <= i; j++) // Тъй като тук имаме инкрементация, на 1ви ред ще се принтират най-малко символи, а на последен - най-много.
            {
                i % 2 != 0 ? cout << symbol << setw(2) : cout << setw(2) << symbol; // Според това дали редът е четен или нечетен, задаваме как да изглежда шаблонът за съответния ред.
            }

            for (int k = rows; k >= i; k--) // Тъй като тук имаме декремантация, на 1ви ред ще се принтират най-много символи, а на последен - най-малко.
            {
                i % 2 != 0 ? cout << symbol << setw(2) : cout << setw(2) << symbol; // Според това дали редът е четен или нечетен, задаваме как да изглежда шаблонът.
            }

            // Когато комбинираме двата вложени for цикъла, на всеки ред ще имаме по еднакъв брой символи.

            cout << endl; // Отделяме всеки създаден шаблон на отеделен ред.
        }
    }

    return 0;
}