#include <iostream>
#include <cmath>
using namespace std;

/*2. Напишете програма която намира броя на всички четирицифрени числа на които
третата и първата цифра са еднакви. Четирицифрените числа са тези в интервала [1000 -
9999].
Четирицифрени числа с еднакви трета и първа цифра са:
1010 1011 1012 1013 … 9996 9997 9998
Броят е: 899*/

int main()
{

    // С for цикъл обхождаме всички 4-цифрени числа едно по едно.
    int counter = 0; // преброяваме колко са числата, които отговарят на условието
    for (int i = 1000; i <= 9999; i++)
    {
        int firstDigit = i / 1000 % 10; // намираме първата цифра на всяко число.
        int thirdDigit = i / 10 % 10;   // намираме третата цифра на всяко число.

        if (firstDigit == thirdDigit) // сравняваме 1ва и 3та цифра и ако съвпадат, принтираме резултата.
        {
            cout << i << endl; //принтираме числата, които отговарят на условието
            counter++; //увеличаваме counter с едно всеки път, когато дадено число отговаря на условието
        }
    }

    cout << "Counter: " << counter << endl; // Броят е 900, тъй като са включени всички числа между 1000 и 9999.

    return 0;
}